package repository

import (
	"log"

	_ "github.com/go-sql-driver/mysql"
)

func InsertBooks() {

	Opendb()
	defer db.Close()

	_, err := db.Exec("INSERT INTO Tags(id,tagname) VALUES ('100', 'プログラミング・開発系'),('101','Java'),('102','Python'),('103','C言語'),('104','Unity'),('105','JavaScript'),('106','PHP'),('107','Ruby'),('108','Perl'),('109','RaspberryPi'),('110','AWS'),('111','モバイル開発'),('112','Web開発'),('113','CUI'),('114','プログラミング・開発系その他'),('200','教育'),('201','数学'),('202','心理学'),('203','統計学'),('204','物理学'),('205','建築学'),('206','語学'),('207','資格'),('208','教育その他'),('300','IT'),('301','データベース'),('302','機械学習'),('303','画像処理'),('304','アルゴリズム'),('305','インフラ'),('306','AR・VR'),('307','IoT'),('308','ITその他'),('000','その他'),('001','エンタメ'),('002','自己啓発'),('003','ビジネス'),('004','デザイン'),('005','Office'),('006','照明'),('007','タグなし')")

	if err != nil {
		log.Fatal(err.Error())
	}
}
